# 最长公共子序列  重点是两个字符串的公共子序列  可不连续，但顺序必须一致
# 比如 a="helloworld"   b="loop" 结果为 "loo"

# 分析
# 令C(i,j)表示a的第i个元素和b的第j个元素的公共子序列长度
# A(i)表示序列a的第i个元素，B（j）表示b序列的第j个元素
# 如果A(i) == B(j)  那就是   结果可以在i-1 和 j-1中找 即 C(i,j) = A(i-1,B(j-1) + 1
# 如果 i ！= j 则在 C(i-1,j) 和 C(i,j-1)中求最大值
# 代码如下

a = "123456778"
b = "357486782"

dp = [[0 for i in range(len(a)+1)] for j in range(len(b)+1)]

for i in range(1,len(b)+1):
    for j in range(1,len(a)+1):
        if a[j-1] == b[i-1]:
            dp[i][j] = dp[i-1][j-1] + 1
        else:
            dp[i][j] = max(dp[i-1][j],dp[i][j-1])


for i in dp:
    print(i)
# [0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
# [0, 0, 0, 1, 1, 1, 1, 1, 1, 1]
# [0, 0, 0, 1, 1, 2, 2, 2, 2, 2]
# [0, 0, 0, 1, 1, 2, 2, 3, 3, 3]
# [0, 0, 0, 1, 2, 2, 2, 3, 3, 3]
# [0, 0, 0, 1, 2, 2, 2, 3, 3, 4]
# [0, 0, 0, 1, 2, 2, 3, 3, 3, 4]
# [0, 0, 0, 1, 2, 2, 3, 4, 4, 4]
# [0, 0, 0, 1, 2, 2, 3, 4, 4, 5]
# [0, 0, 1, 1, 2, 2, 3, 4, 4, 5]

# 怎么找到子序列呢？
# 使得 i = len(b) j = len(b)
# 当 a[j] == b[i] 时，最大数会加1
# 当 a[j] ！= b[i] 时，dp[i][j] 会从dp[i-1][j] dp[i][j-1]
# 取最大值(这里会有个问题，dp[i-1][j]=dp[i][j-1]，优先选上还是右，会出现两种结果)

# 下面有限选右

i = len(b)
j = len(a)

string = ""

while (i > 0) and (j > 0):
    if a[j-1] == b[i-1]:
        string = string + a[j-1]
        i -= 1
        j -= 1
    else:
        if dp[i-1][j] < dp[i][j-1]:
            j -= 1
        elif dp[i-1][j] > dp[i][j-1]:
            i -= 1
        else:
            j -= 1

print(string[::-1])


